app/controllers/api/tracks_controller.rb

    def index
        @tracks = Track.with_attached_audio.with_attached_image.includes(:uploader).where(uploader_id: params[:user_id])
---
SELECT "tracks".* FROM "tracks" WHERE "tracks"."uploader_id" IS NULL