app/controllers/api/tracks_controller.rb

    def index
        @tracks = Track.with_attached_audio.with_attached_image.includes(:users)
---
SELECT "tracks".* FROM "tracks"
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2)  [["id", 7], ["id", 8]]

    def create
        @track = Track.new(track_params)
        if @track.save
---
INSERT INTO "tracks" ("title", "description", "playlist_id", "uploader_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test"], ["description", "co"], ["playlist_id", 0], ["uploader_id", 8], ["created_at", "2019-08-06 03:13:35.971257"], ["updated_at", "2019-08-06 03:13:35.971257"]]

    def update
        @track = Track.find(params[:id])
        if @track.update(track_params)
---
UPDATE "tracks" SET "updated_at" = $1 WHERE "tracks"."id" = $2  [["updated_at", "2019-08-06 02:33:55.086003"], ["id", 28]]