app/models/user.rb

UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "2xPevt4q6aMqRFfyKmcerw"], ["updated_at", "2019-08-02 14:51:01.288507"], ["id", 6]]
---
    def reset_session_token!
        self.update!(session_token: User.generate_session_token)